function groupArr(data, n) {
  const group = []
  for (let i = 0, j = 0; i < data.length; i += 1) {
    if (i >= n && i % n === 0) j += 1
    group[j] = group[j] || []
    group[j].push(data[i])
  }
  return group
}

export const layouts = {
  Kedmanee: {
    rows: [
      ['ภ', 'ถ', 'ุ', 'ึ', 'ค', 'ต', 'จ', 'ข', 'ช', '⬅'],
      ['ไ', 'ำ', 'พ', 'ะ', 'ั', 'ี', 'ร', 'น', 'ย', 'บ', 'ล'],
      ['ฟ', 'ห', 'ก', 'ด', 'เ', '้', '่', 'า', 'ส', 'ว', 'ง'],
      ['⇧', 'ผ', 'ป', 'แ', 'อ', 'ิ', 'ื', 'ท', 'ม', 'ใ', 'ฝ', 'ตกลง'],
    ],
    rowsShifted: [
      ['ภ', 'ถ', 'ู', 'ึ', 'ค', 'ต', 'จ', 'ข', 'ช', '⬅'],
      ['ไ', 'ฎ', 'ฑ', 'ธ', 'ั', '๊', 'ณ', 'น', 'ญ', 'ฐ', 'ล'],
      ['ฤ', 'ฆ', 'ฏ', 'โ', 'ฌ', '็', '๋', 'ษ', 'ศ', 'ซ', 'ง'],
      ['⇧', 'ผ', 'ป', 'ฉ', 'ฮ', 'ิ', '์', 'ท', 'ฒ', 'ฬ', 'ฝ', 'ตกลง'],
    ],
  },
  'ก-ฮ': {
    rows: groupArr(
      'กขคฆงจฉชซฌ⬅ญฎฏฐฑฒณดตถทธนบปผฝพฟภมยรลวศษสหฬอฮะัาิีึืุูเแโำใไฤ่้๊๋์็↵'.split(''),
      11,
    ),
    rowsShifted: groupArr(
      'กขคฆงจฉชซฌ⬅ญฎฏฐฑฒณดตถทธนบปผฝพฟภมยรลวศษสหฬอฮะัาิีึืุูเแโำใไฤ่้๊๋์็↵'.split(''),
      11,
    ),
  },
}
